# Data Exploration

### Overdose / Opioid Data
From the [Georgia Dept of Public Health's Data Warehouse](https://oasis.state.ga.us/oasis/webquery/qryDrugOverdose.aspx)

NOTE: The data table was created by selecting all options possible

In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt
%matplotlib inline

import seaborn as sns
sns.set(style="ticks", color_codes=True)

In [3]:
# data file
csv_data = '../data/overdose_opioid_data_edited.csv'

In [4]:
# create pandas dataframe (AKA df)
df = pd.read_csv(csv_data)

In [5]:
# first five rows of the data
# switch head for tail to get last five rows
df.head()

,Geography,Deaths_1999,Death_Rate_1999,Age_Adjusted_Death_Rate_1999,Pct_Deathsby_Cause_1999,Deaths_2000,Death_Rate_2000,Age_Adjusted_Death_Rate_2000,Pct_Deathsby_Cause_2000,Deaths_2001,...,Age_Adjusted_Death_Rate_2016,Pct_Deathsby_Cause_2016,Deaths_2017,Death_Rate_2017,Age_Adjusted_Death_Rate_2017,Pct_Deathsby_Cause_2017,Deaths_Selected_Years_Total,Death_Rate_Selected_Years_Total,Age_Adjusted_Death_Rate_Selected_Years_Total,Pct_Deathsby_Cause_Selected_Years_Total
0,Georgia,274,3.4,3.4,0.4,383,4.7,4.6,0.6,492,...,13.1,1.7,"1,529",14.7,14.6,1.8,"16,362",9.2,9.1,1.2
1,Appling,2,*,*,*,1,*,*,*,1,...,*,*,1,*,*,*,25,7.3,7.5,0.7
2,Atkinson,1,*,*,*,0,0,0,0,0,...,*,*,4,*,*,*,16,10.4,10.9,1.2
3,Bacon,0,0,0,0,0,0,0,0,1,...,0,0,1,*,*,*,21,10.2,10.8,0.9
4,Baker,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,*,*,*

In [6]:
# transpose data table
df = df.T
df.head()

,0,1,2,3,4,5,6,7,8,9,...,151,152,153,154,155,156,157,158,159,160
Geography,Georgia,Appling,Atkinson,Bacon,Baker,Banks,Ben_Hill,Berrien,Bleckley,Brantley,...,Rockdale,Spalding,Thomas,Tift,Troup,Walker,Walton,Ware,Whitfield,County_Summary
Deaths_1999,274,2,1,0,0,0,0,0,0,0,...,1,1,1,0,0,3,2,1,3,274
Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Age_Adjusted_Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Pct_Deathsby_Cause_1999,0.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,0.4

In [7]:
# set first row as column headers
df.columns = df.iloc[0]
df.head()

Geography,Georgia,Appling,Atkinson,Bacon,Baker,Banks,Ben_Hill,Berrien,Bleckley,Brantley,...,Rockdale,Spalding,Thomas,Tift,Troup,Walker,Walton,Ware,Whitfield,County_Summary
Geography,Georgia,Appling,Atkinson,Bacon,Baker,Banks,Ben_Hill,Berrien,Bleckley,Brantley,...,Rockdale,Spalding,Thomas,Tift,Troup,Walker,Walton,Ware,Whitfield,County_Summary
Deaths_1999,274,2,1,0,0,0,0,0,0,0,...,1,1,1,0,0,3,2,1,3,274
Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Age_Adjusted_Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Pct_Deathsby_Cause_1999,0.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,0.4

In [8]:
# drop first row
df = df.iloc[1:]
df.head()

Geography,Georgia,Appling,Atkinson,Bacon,Baker,Banks,Ben_Hill,Berrien,Bleckley,Brantley,...,Rockdale,Spalding,Thomas,Tift,Troup,Walker,Walton,Ware,Whitfield,County_Summary
Deaths_1999,274,2,1,0,0,0,0,0,0,0,...,1,1,1,0,0,3,2,1,3,274
Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Age_Adjusted_Death_Rate_1999,3.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,3.4
Pct_Deathsby_Cause_1999,0.4,*,*,0,0,0,0,0,0,0,...,*,*,*,0,0,*,*,*,*,0.4
Deaths_2000,383,1,0,0,0,3,1,1,0,0,...,7,2,1,1,2,2,0,0,3,383

In [9]:
# change all * vals to NaN
cols = df.columns
for col in cols:
    df.loc[df[col] == '*', col] = np.nan
    
# look at NaN counts for each column
df.isna().sum()

Geography
Georgia            0
Appling           45
Atkinson          30
Bacon             33
Baker              6
Banks             39
Ben_Hill          30
Berrien           33
Bleckley          27
Brantley          36
Brooks            27
Bryan             36
Burke             48
Butts             36
Calhoun           12
Candler           27
Charlton          27
Chattahoochee     24
Chattooga         33
Clay              12
Clinch            24
Cook              36
Crawford          45
Crisp             36
Dade              27
Dawson            30
Decatur           36
Dodge             42
Dooly             21
Early             18
                  ..
Floyd              3
Forsyth            3
Fulton             0
Glynn             18
Gordon            18
Gwinnett           0
Habersham         33
Hall               3
Henry              3
Houston            9
Jackson           12
Laurens           21
Liberty           33
Lowndes           21
Murray             9
Muscogee           3
Newton            12
Paulding           3
Polk              15
Richmond           0
Rockdale           9
Spalding          15
Thomas            51
Tift              30
Troup             24
Walker            15
Walton             6
Ware              39
Whitfield         18
County_Summary     0
Length: 161, dtype: int64

In [10]:
# shape of the dataframe (rows, columns)
df.shape

(80, 161)

In [11]:
df.isna().sum().sort_values()

Geography
Georgia            0
Richmond           0
Gwinnett           0
Fulton             0
DeKalb             0
Cobb               0
Clayton            0
Chatham            0
Bibb               0
County_Summary     0
Hall               3
Forsyth            3
Floyd              3
Muscogee           3
Paulding           3
Cherokee           3
Henry              3
Baker              6
Douglas            6
Randolph           6
Coweta             6
Bartow             6
Barrow             6
Taliaferro         6
Walton             6
Carroll            6
Treutlen           9
Terrell            9
Houston            9
Schley             9
                  ..
Jeff_Davis        39
Peach             39
Jones             39
Baldwin           39
Upson             39
Mitchell          39
Hart              39
Putnam            42
Toombs            42
Towns             42
Washington        42
Heard             42
Dodge             42
Jasper            42
Colquitt          42
Crawford          45
Lee               45
Appling           45
Pickens           45
Tattnall          45
Elbert            45
Harris            45
McDuffie          45
Rabun             45
Lamar             48
Monroe            48
Burke             48
Union             51
Thomas            51
Pierce            54
Length: 161, dtype: int64

In [12]:
# seaborn pairplot
# g = sns.pairplot(df)

In [13]:
df.head()

Geography,Georgia,Appling,Atkinson,Bacon,Baker,Banks,Ben_Hill,Berrien,Bleckley,Brantley,...,Rockdale,Spalding,Thomas,Tift,Troup,Walker,Walton,Ware,Whitfield,County_Summary
Deaths_1999,274,2,1,0,0,0,0,0,0,0,...,1,1,1,0,0,3,2,1,3,274
Death_Rate_1999,3.4,NaN,NaN,0,0,0,0,0,0,0,...,NaN,NaN,NaN,0,0,NaN,NaN,NaN,NaN,3.4
Age_Adjusted_Death_Rate_1999,3.4,NaN,NaN,0,0,0,0,0,0,0,...,NaN,NaN,NaN,0,0,NaN,NaN,NaN,NaN,3.4
Pct_Deathsby_Cause_1999,0.4,NaN,NaN,0,0,0,0,0,0,0,...,NaN,NaN,NaN,0,0,NaN,NaN,NaN,NaN,0.4
Deaths_2000,383,1,0,0,0,3,1,1,0,0,...,7,2,1,1,2,2,0,0,3,383